Config/AccumulationRegisters/РезервМЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РезервМЗ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопАналитика</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/AccumulationRegisters/РезервОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РезервОС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДопАналитика</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/CommonModules/РезервированиеНФА/Ext/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Проверяет, включено ли в базе резервирование сумм МЗ при выбытии.
// 
// Возвращаемое значение:
//  Булево -  Используется резервирование сумм
Функция ИспользуетсяРезервированиеСумм() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("РезервироватьМЗПриВыбытии")
		И ПолучитьФункциональнуюОпцию("РезервироватьСуммуМЗПриВыбытии");
КонецФункции

// При создании на сервере.
// 
// Параметры:
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//   * Объект - ДанныеФормыСтруктура:
//    ** Ссылка - ДокументСсылка
//    ** Проведен - Булево
//    ** Аннулировано - Булево
//    ** Резервировать - Булево
//  * Элементы - ВсеЭлементыФормы:
//   ** ПереключательРезервирование - ПолеВвода
Процедура ПриСозданииНаСервере(Форма) Экспорт

	Если ЭтоТипДокументаРезервированияМЗ(ТипЗнч(Форма.Объект.Ссылка))
		ИЛИ ЭтоТипДокументаРезервированияОС(ТипЗнч(Форма.Объект.Ссылка)) Тогда

		Если ПолучитьФункциональнуюОпцию("РезервироватьМЗПриВыбытии")
			ИЛИ ПолучитьФункциональнуюОпцию("РезервироватьОСПриВыбытии") Тогда
				
			ЗаполнитьСписокВыбораПереключателяРезервирование(Форма.Элементы.ПереключательРезервирование);
			УстановитьОформлениеГруппыРезервирование(Форма);
			ПриСозданииНаСервереДокумента(Форма);
		Иначе
			Объект = Форма.Объект;
			Если Объект.Ссылка.Пустая() Тогда
				ЗначениеРезервировать = Новый Структура("Резервировать", Ложь);
				ЗаполнитьЗначенияСвойств(Объект, ЗначениеРезервировать);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Перед записью.
// 
// Параметры:
//  Объект - ДокументОбъект
//  РежимЗаписи - РежимЗаписиДокумента
//  Отказ - Булево
Процедура ПередЗаписью(Объект, РежимЗаписи, Отказ) Экспорт

	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоТипДокументаРезервированияМЗ(ТипЗнч(Объект.Ссылка))
		И ПолучитьФункциональнуюОпцию("РезервироватьМЗПриВыбытии") Тогда
		
		ПередЗаписьюДокумента(Объект, РежимЗаписи, Отказ);
		СформироватьДвиженияРезервированиеМЗ(Объект, Отказ);
		
	ИначеЕсли ЭтоТипДокументаРезервированияОС(ТипЗнч(Объект.Ссылка))
		И ПолучитьФункциональнуюОпцию("РезервироватьОСПриВыбытии") Тогда
		
		ПередЗаписьюДокумента(Объект, РежимЗаписи, Отказ);
		СформироватьДвиженияРезервированиеОС(Объект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Это резервирование НФА.
// 
// Параметры:
//  Объект - ДокументОбъект:
//   * Резервировать - Булево
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоРезервированиеНФА(Объект) Экспорт
	Если ЭтоТипДокументаРезервированияМЗ(ТипЗнч(Объект.Ссылка)) 
		И ПолучитьФункциональнуюОпцию("РезервироватьМЗПриВыбытии")
		ИЛИ ЭтоТипДокументаРезервированияОС(ТипЗнч(Объект.Ссылка))
		И ПолучитьФункциональнуюОпцию("РезервироватьОСПриВыбытии") Тогда
		Возврат Объект.Резервировать;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ЭтоТипДокументаРезервированияМЗ(ТипДокумента) Экспорт
	Возврат ТипыДокументовРезервированияМЗ().Получить(ТипДокумента) <> Неопределено;
КонецФункции

Функция ЭтоТипДокументаРезервированияОС(ТипДокумента) Экспорт
	Возврат ТипыДокументовРезервированияОС().Получить(ТипДокумента) <> Неопределено;
КонецФункции

// Списать резерв после формирования проводок.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект
//  ДополнительныеРеквизиты - Структура
//  ТаблицаПроводок - ТаблицаЗначений
Процедура СписатьРезервМЗПослеФормированияПроводок(ДокументОбъект, ДополнительныеРеквизиты, ТаблицаПроводок) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РезервироватьМЗПриВыбытии")
		Или Не ОбщегоНазначения.ЕстьРеквизитОбъекта("Резервировать", ДокументОбъект.Метаданные()) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументОбъект.Резервировать Тогда
		ТаблицаПроводок.Очистить();
		Возврат;
	КонецЕсли;
	
	ДвиженияРезерва = РегистрыНакопления.РезервМЗ.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ДокументОбъект.ДополнительныеСвойства.Вставить("ДвиженияРезервТМЦ", ДвиженияРезерва);
	Если Не ДокументОбъект.Резервировать Тогда
		ДобавитьДвиженияРезервированияМЗТекущегоДокумента(ДокументОбъект, ДвиженияРезерва);
		Если ДвиженияРезерва.Количество() = 0 Тогда
			// Документ не делал резервирование.
			// Значит не нужно делать списание резервов.
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДобавитьДвиженияСписанияРезерва(ДвиженияРезерва,
		БухгалтерскийУчет.УстановленнаяДатаПроведения(ДокументОбъект.Ссылка));
	
	НаборЗаписей = РегистрыНакопления.РезервМЗ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
	НаборЗаписей.Загрузить(ДвиженияРезерва);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Списать резерв после формирования проводок.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект
//  ДополнительныеРеквизиты - Структура
//  ТаблицаПроводок - ТаблицаЗначений
Процедура СписатьРезервОСПослеФормированияПроводок(ДокументОбъект, ДополнительныеРеквизиты, ТаблицаПроводок) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РезервироватьОСПриВыбытии")
		Или Не ОбщегоНазначения.ЕстьРеквизитОбъекта("Резервировать", ДокументОбъект.Метаданные()) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументОбъект.Резервировать Тогда
		ТаблицаПроводок.Очистить();
		Возврат;
	КонецЕсли;
	
	ДвиженияРезерва = РегистрыНакопления.РезервОС.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ДокументОбъект.ДополнительныеСвойства.Вставить("ДвиженияРезервОС", ДвиженияРезерва);
	Если Не ДокументОбъект.Резервировать Тогда
		ДобавитьДвиженияРезервированияОСТекущегоДокумента(ДокументОбъект, ДвиженияРезерва);
		Если ДвиженияРезерва.Количество() = 0 Тогда
			// Документ не делал резервирование.
			// Значит не нужно делать списание резервов.
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДобавитьДвиженияСписанияРезерва(ДвиженияРезерва,
		БухгалтерскийУчет.УстановленнаяДатаПроведения(ДокументОбъект.Ссылка));
	
	НаборЗаписей = РегистрыНакопления.РезервОС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
	НаборЗаписей.Загрузить(ДвиженияРезерва);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Заполнить список выбора переключателя резервирование.
// 
// Параметры:
//  ЭлементФормы - ПолеВвода
Процедура ЗаполнитьСписокВыбораПереключателяРезервирование(ЭлементФормы) Экспорт
	ЭлементФормы.СписокВыбора.Очистить();
	ЭлементФормы.СписокВыбора.Добавить(1, НСтр("ru = 'Резервирование'"));
	ЭлементФормы.СписокВыбора.Добавить(0, НСтр("ru = 'Списание'"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииНаСервереДокумента(Форма)
	Объект = Форма.Объект;
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Аннулирован",
			"Видимость", Ложь);
	КонецЕсли;
КонецПроцедуры

// Перед записью документа.
// 
// Параметры:
//  Объект - ДокументОбъект:
//   * Аннулирован - Булево
//   * Резервировать - Булево
//  РежимЗаписи - РежимЗаписиДокумента - Режим записи
//  Отказ - Булево - Отказ
Процедура ПередЗаписьюДокумента(Объект, РежимЗаписи, Отказ)
	Если Объект.Аннулирован Тогда
		ВызватьИсключение НСтр("ru = 'Аннулированный документ не может быть проведен'");
	КонецЕсли;
КонецПроцедуры

Функция ТипыДокументовРезервированияМЗ()
	Результат = Новый Соответствие; // Соответствие из Тип
	Результат.Вставить(Тип("ДокументСсылка.АктОбУтилизацииМЗ"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.АктСписанияИК"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.АктСписанияМЗ"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.АктСписанияМягкогоИХозИнвентаря"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.ВедомостьНаВыдачуМЗНаНуждыУчреждения"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.МенюТребование"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.НакладнаяНаОтпускИК"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.НакладнаяНаОтпускМ15"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомМЗ"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомМЗИК"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.ТребованиеНакладная0315006"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.ТребованиеНакладнаяИК"), Истина);
	Возврат Результат;
КонецФункции

Функция ТипыДокументовРезервированияОС()
	Результат = Новый Соответствие; // Соответствие из Тип
	Результат.Вставить(Тип("ДокументСсылка.АктОбУтилизацииОС"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.АктОбУтилизацииОСИК"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.СписаниеОбъектовОС"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.СписаниеОбъектовИК"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.СписаниеТранспорта"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.СписаниеТранспортаИК"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.ПередачаОбъектовОС"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.ПередачаОбъектовИК"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.СписаниеЛитературы"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.АктСписанияМягкогоИХозИнвентаряОС"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивом"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомИК"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.НакладнаяНаВнутреннееПеремещениеОС2"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.ВнутреннееПеремещениеИК"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.ТребованиеНакладнаяОС"), Истина);
	Результат.Вставить(Тип("ДокументСсылка.ВедомостьНаВыдачуОСНаНуждыУчреждения"), Истина);
	Возврат Результат;
КонецФункции

// Сформировать движения резервирование МЗ.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект
//  Отказ - Булево
Процедура СформироватьДвиженияРезервированиеМЗ(ДокументОбъект, Отказ) Экспорт
	
	ДвиженияРезерва = ТаблицаДвиженийРезервТМЦ();
	ДокументОбъект.ДополнительныеСвойства.Вставить("ДвиженияРезервТМЦ", ДвиженияРезерва);
	Если Не ДокументОбъект.Резервировать Тогда
		ДобавитьДвиженияРезервированияМЗТекущегоДокумента(ДокументОбъект, ДвиженияРезерва);
		Если ДвиженияРезерва.Количество() = 0 Тогда
			// Документ не делал резервирование.
			// Значит не нужно делать списание резервов.
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ДокументОбъект.Резервировать Тогда
		// Списание резерва делается в обработчике "После формирования проводок"
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Параметры.Вставить("Организация",     ДокументОбъект.Организация);
	Параметры.Вставить("Дата",            ДокументОбъект.Дата);
	
	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументу(
		ДокументОбъект, Параметры, Отказ);
	УправлениеМатериальнымиЗапасами.ДоработатьТаблицуДокументаДляДвиженийРемонт(ДокументОбъект, ТаблицаДокумента);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	// Подготовим таблицу для отражения списания материальных запасов.
	ТаблицаСписания = УправлениеМатериальнымиЗапасами.ТаблицаСписаниеМатериальныхЗапасов(
		ТаблицаДокумента, Параметры, Отказ);
	// Превышение остатка проверяем только по БУ. Такой подход используется во всех типовых операциях по списанию МЗ.
	Если УправлениеМатериальнымиЗапасами.ОстатокПревышенПоТаблицеСписания(ТаблицаСписания, "БУ") Тогда
		Отказ = Истина;
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Не удалось провести ""%1""'"), Строка(ДокументОбъект));
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	// Сохраним таблицу списания для дальнейшего использования
	РассчитанныеДанные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДокументОбъект.ДополнительныеСвойства,
		"РассчитанныеДанные",
		Новый Структура); // Структура
	РассчитанныеДанные.Вставить("ТаблицаСписания", ТаблицаСписания);
	ДокументОбъект.ДополнительныеСвойства.Вставить("РассчитанныеДанные", РассчитанныеДанные);
	
	ДобавитьДвиженияРезервовПоТаблицеСписания(ДокументОбъект, ТаблицаСписания);
	
КонецПроцедуры

// Сформировать движения резервирование ОС.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект
//  Отказ - Булево
Процедура СформироватьДвиженияРезервированиеОС(ДокументОбъект, Отказ) Экспорт
	
	ДвиженияРезерва = ТаблицаДвиженийРезервОС();
	ДокументОбъект.ДополнительныеСвойства.Вставить("ДвиженияРезервОС", ДвиженияРезерва);
	Если Не ДокументОбъект.Резервировать Тогда
		ДобавитьДвиженияРезервированияОСТекущегоДокумента(ДокументОбъект, ДвиженияРезерва);
		// Списание резерва делается в обработчике "После формирования проводок"
		Возврат;
	КонецЕсли;
	
//	ДокументОбъект.ТаблицаСписанияОСПоДокументу(ДвиженияРезерва);
	ТаблицаДока = ДокументОбъект.ТаблицаСписанияОСПоДокументу();
	Для каждого СтрокаДока из ТаблицаДока Цикл
		СтрокаРезерва = ДвиженияРезерва.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРезерва, СтрокаДока);
		СтрокаРезерва.Период = ДокументОбъект.Дата;
	КонецЦикла;	
КонецПроцедуры

Процедура ДобавитьДвиженияСписанияРезерва(ДвиженияРезерва, ДатаПроведения = '00010101')

	Для Индекс = 0 По ДвиженияРезерва.Количество() - 1 Цикл
		СтрокаРезерва = ДвиженияРезерва[Индекс];
		СписаниеРезерва = ДвиженияРезерва.Добавить();
		ЗаполнитьЗначенияСвойств(СписаниеРезерва, СтрокаРезерва);
		СписаниеРезерва.ВидДвижения = ВидДвиженияНакопления.Расход;
		Если ЗначениеЗаполнено(ДатаПроведения) Тогда
			СписаниеРезерва.Период = ДатаПроведения;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
 

// Таблица движений резерв ТМЦ.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица движений резерв ТМЦ
Функция ТаблицаДвиженийРезервТМЦ()
	Возврат РегистрыНакопления.РезервМЗ.СоздатьНаборЗаписей().ВыгрузитьКолонки();
КонецФункции

// Таблица движений резерв ОС.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица движений резерв ОС
Функция ТаблицаДвиженийРезервОС()
	Возврат РегистрыНакопления.РезервОС.СоздатьНаборЗаписей().ВыгрузитьКолонки();
КонецФункции

// Добавить движения резервов по таблице списания.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект:
//   * ДополнительныеСвойства - Структура:
//    ** ДвиженияРезервТМЦ - см. ТаблицаДвиженийРезервТМЦ
//  ТаблицаСписания - ТаблицаЗначений
Процедура ДобавитьДвиженияРезервовПоТаблицеСписания(ДокументОбъект, ТаблицаСписания)

	Если ДокументОбъект.Резервировать Тогда
		ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе
		ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	ИспользоватьУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	РезервироватьСумму = ПолучитьФункциональнуюОпцию("РезервироватьСуммуМЗПриВыбытии");

	Счета106 = Новый Соответствие;
	Для Каждого Счет Из БухгалтерскийУчет.СписокСчетов("106.00") Цикл
		Счета106.Вставить(Счет, Истина);
	КонецЦикла;
	
	ДвиженияРезервТМЦ = ДокументОбъект.ДополнительныеСвойства.ДвиженияРезервТМЦ; // см. ТаблицаДвиженийРезервТМЦ
	Для Каждого СтрокаСписания Из ТаблицаСписания Цикл
		
		Если СтрокаСписания.ВидУчета <> "БУ" Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ РезервироватьСумму И СтрокаСписания.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваСчетаУчета = УправлениеМатериальнымиЗапасамиПовтИсп.СвойстваСчетаДляУчетаМЗ(СтрокаСписания.СчетУчета,
			СтрокаСписания.ДопАналитикаВидСубконто,
			СтрокаСписания.ДопИзмерениеВидСубконто,
			СтрокаСписания.ПартияВидСубконто);
		
		Если НЕ СвойстваСчетаУчета.ДопАналитикаЕстьСубконто Или СвойстваСчетаУчета.ДопАналитикаТолькоОбороты Тогда
			ИспользоватьДопАналитику = Ложь;
		ИначеЕсли ПолучитьФункциональнуюОпцию("РезервироватьСуммуМЗПриВыбытии") Тогда
			ИспользоватьДопАналитику = СвойстваСчетаУчета.ДопАналитикаСуммовой;
		Иначе
			ИспользоватьДопАналитику = СвойстваСчетаУчета.ДопАналитикаКоличественный
				И ((Счета106.Получить(СтрокаСписания.СчетУчета) <> Неопределено
					И СтрокаСписания.ДопАналитикаВидСубконто <> ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат)
					Или (Счета106.Получить(СтрокаСписания.СчетУчета) = Неопределено
					И СтрокаСписания.ДопАналитикаВидСубконто <> ПланыВидовХарактеристик.ВидыСубконто.Партии));
		КонецЕсли;
		
		НоваяСтрокаДвижения = ДвиженияРезервТМЦ.Добавить();
		НоваяСтрокаДвижения.ВидДвижения = ВидДвижения;
		НоваяСтрокаДвижения.Период = ДокументОбъект.Дата;
		НоваяСтрокаДвижения.Организация = ДокументОбъект.Организация;
		НоваяСтрокаДвижения.Номенклатура = СтрокаСписания.Номенклатура;
		Если СвойстваСчетаУчета.ДопИзмерениеЕстьСубконто Тогда
			НоваяСтрокаДвижения.ЦМО = СтрокаСписания.ДопИзмерение;
		КонецЕсли;
		НоваяСтрокаДвижения.КФО = СтрокаСписания.КФО;
		НоваяСтрокаДвижения.СчетУчета = СтрокаСписания.СчетУчета;
		НоваяСтрокаДвижения.Количество = СтрокаСписания.Количество;
		Если РезервироватьСумму Тогда
			НоваяСтрокаДвижения.Сумма = СтрокаСписания.Стоимость;
		КонецЕсли;
		Если ИспользоватьДопАналитику Тогда
			НоваяСтрокаДвижения.ДопАналитика = СтрокаСписания.ДопАналитика;
		ИначеЕсли СвойстваСчетаУчета.ПартияЕстьСубконто И СвойстваСчетаУчета.ПартияСуммовой Тогда
			НоваяСтрокаДвижения.ДопАналитика = СтрокаСписания.Партия;
		КонецЕсли;
		Если СвойстваСчетаУчета.УчетПоКПС Тогда
			НоваяСтрокаДвижения.КПС = СтрокаСписания.КПС;
		КонецЕсли;
		Если ИспользоватьУчетПоИФО Тогда
			НоваяСтрокаДвижения.ИФО = СтрокаСписания.ИФО;
		КонецЕсли;
		Если ИспользоватьУчетПоПодразделениям И СвойстваСчетаУчета.УчетПоПодразделениям Тогда
			НоваяСтрокаДвижения.Подразделение = СтрокаСписания.Подразделение;
		КонецЕсли;
		
	КонецЦикла;
	
	СворачиваемыеКолонки = Новый Массив;
	СуммируемыеКолонки = Новый Массив;
	СуммируемыеКолонки.Добавить("Количество");
	СуммируемыеКолонки.Добавить("Сумма");
	СуммируемыеКолонкиИнд = Новый Структура(СтрСоединить(СуммируемыеКолонки, ","));
	
	Для Каждого Колонка Из ДвиженияРезервТМЦ.Колонки Цикл
		Если НЕ СуммируемыеКолонкиИнд.Свойство(Колонка.Имя) Тогда
			СворачиваемыеКолонки.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	ДокументОбъект.ДополнительныеСвойства.ДвиженияРезервТМЦ.Свернуть(
		СтрСоединить(СворачиваемыеКолонки, ","),
		СтрСоединить(СуммируемыеКолонки, ","));

КонецПроцедуры

Процедура ДобавитьДвиженияРезервированияМЗТекущегоДокумента(ДокументОбъект, ДвиженияРезерва)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РезервМЗ.Период,
	|	РезервМЗ.ВидДвижения,
	|	РезервМЗ.Организация,
	|	РезервМЗ.Номенклатура,
	|	РезервМЗ.ЦМО,
	|	РезервМЗ.ДопАналитика,
	|	РезервМЗ.КПС,
	|	РезервМЗ.КФО,
	|	РезервМЗ.СчетУчета,
	|	РезервМЗ.ИФО,
	|	РезервМЗ.Подразделение,
	|	РезервМЗ.Количество,
	|	РезервМЗ.Сумма
	|ИЗ
	|	РегистрНакопления.РезервМЗ КАК РезервМЗ
	|ГДЕ
	|	РезервМЗ.Регистратор = &Регистратор
	|	И РезервМЗ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)";
	Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДвиженияРезерва.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДвиженияРезервированияОСТекущегоДокумента(ДокументОбъект, ДвиженияРезерва)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Резерв.Период КАК Период,
	|	Резерв.ВидДвижения КАК ВидДвижения,
	|	Резерв.Организация КАК Организация,
	|	Резерв.ОсновноеСредство КАК ОсновноеСредство,
	|	Резерв.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Резерв.ЦМО КАК ЦМО,
	|	Резерв.ДопАналитика КАК ДопАналитика,
	|	Резерв.КПС КАК КПС,
	|	Резерв.КФО КАК КФО,
	|	Резерв.СчетУчета КАК СчетУчета,
	|	Резерв.ИФО КАК ИФО,
	|	Резерв.Подразделение КАК Подразделение,
	|	Резерв.Количество КАК Количество,
	|	Резерв.Сумма КАК Сумма
	|ИЗ
	|	РегистрНакопления.РезервОС КАК Резерв
	|ГДЕ
	|	Резерв.Регистратор = &Регистратор
	|	И Резерв.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)";
	Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДвиженияРезерва.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

// Установить оформление группы резервирование.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура УстановитьОформлениеГруппыРезервирование(Форма) Экспорт
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппаРезервирование",
		"ЦветФона", Метаданные.ЭлементыСтиля.ЦветФонаВыделения.Значение);
КонецПроцедуры

#КонецОбласти
